martijnschouten/OCHVPS_FW/board/pin_mux.c
    /* PORTB3 (pin 84) is configured as I2C0_SDA */
    PORT_SetPinMux(EEPROM_SDA_PORT, EEPROM_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC10 (pin 115) is configured as I2C1_SCL */
    PORT_SetPinMux(PS_12V_SCL_PORT, PS_12V_SCL_PIN, kPORT_MuxAlt2);

    /* PORTC11 (pin 116) is configured as I2C1_SDA */
    PORT_SetPinMux(PS_12V_SDA_PORT, PS_12V_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(PS_HV_EN_PORT, PS_HV_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(PS_12V_EN_PORT, PS_12V_EN_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 127) is configured as PTD0 */
    PORT_SetPinMux(HB_LG1_PORT, HB_LG1_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 128) is configured as PTD1 */
    PORT_SetPinMux(HB_HG1_PORT, HB_HG1_PIN, kPORT_MuxAsGpio);

    /* PORTD10 (pin 139) is configured as PTD10 */
    PORT_SetPinMux(HB_LG6_PORT, HB_LG6_PIN, kPORT_MuxAsGpio);

    /* PORTD11 (pin 140) is configured as PTD11 */
    PORT_SetPinMux(HB_HG6_PORT, HB_HG6_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 141) is configured as PTD12 */
    PORT_SetPinMux(HB_LG7_PORT, HB_LG7_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin 142) is configured as PTD13 */
    PORT_SetPinMux(HB_HG7_PORT, HB_HG7_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin 143) is configured as PTD14 */
    PORT_SetPinMux(HB_LG8_PORT, HB_LG8_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 144) is configured as PTD15 */
    PORT_SetPinMux(HB_HG8_PORT, HB_HG8_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 129) is configured as PTD2 */
    PORT_SetPinMux(HB_LG2_PORT, HB_LG2_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 130) is configured as PTD3 */
    PORT_SetPinMux(HB_HG2_PORT, HB_HG2_PIN, kPORT_MuxAsGpio);

    /* PORTD4 (pin 131) is configured as PTD4 */
    PORT_SetPinMux(HB_LG3_PORT, HB_LG3_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 132) is configured as PTD5 */
    PORT_SetPinMux(HB_HG3_PORT, HB_HG3_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 133) is configured as PTD6 */
    PORT_SetPinMux(HB_LG4_PORT, HB_LG4_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 136) is configured as PTD7 */
    PORT_SetPinMux(HB_HG4_PORT, HB_HG4_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as PTD8 */
    PORT_SetPinMux(HB_LG5_PORT, HB_LG5_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 138) is configured as PTD9 */
    PORT_SetPinMux(HB_HG5_PORT, HB_HG5_PIN, kPORT_MuxAsGpio);

    /* PORTE24 (pin 45) is configured as ADC0_SE17 */
    PORT_SetPinMux(PS_12V_VM_PORT, PS_12V_VM_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE25 (pin 46) is configured as ADC0_SE18 */
    PORT_SetPinMux(PS_HV_VM_PORT, PS_HV_VM_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE9 (pin 12) is configured as PTE9 */
    PORT_SetPinMux(PS_SW_STATE_PORT, PS_SW_STATE_PIN, kPORT_MuxAsGpio);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK)))

                  /* UART 0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

                  /* UART 0 receive data source select: UART0_RX pin. */
                  | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
